In [1]:
import pandas as pd
import numpy as  np

In [5]:
date= pd.read_csv("Datasets/orders.csv")

In [6]:
date.head(3)

         date  product_id  city_id  orders
0  2019-12-10        5628       25       3
1  2018-08-15        3646       14     157
2  2018-10-23        1859       25       1

In [7]:
time= pd.read_csv("Datasets/messages.csv")

In [8]:
time.head(3)

                  date                                               msg
0  2013-12-15 00:50:00                          ищу на сегодня мужика 37
1  2014-04-29 23:40:00  ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826
2  2012-12-30 00:21:00          Днепр.м 43 позн.с д/ж *.о  067.16.34.576

In [9]:
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   object
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: int64(3), object(1)
memory usage: 31.4+ KB

In [10]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   object
 1   msg     1000 non-null   object
dtypes: object(2)
memory usage: 15.8+ KB

In [11]:
#converting to datetime datatype
date['date'] = pd.to_datetime(date['date'])

In [12]:
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   datetime64[ns]
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: datetime64[ns](1), int64(3)
memory usage: 31.4 KB

In [13]:
date['date_year'] = date['date'].dt.year #extract year from dataset
date.head(3)

        date  product_id  city_id  orders  date_year
0 2019-12-10        5628       25       3       2019
1 2018-08-15        3646       14     157       2018
2 2018-10-23        1859       25       1       2018

In [14]:
date['date_month']= date['date'].dt.month #extract month from the dataset

In [15]:
date.head(3)

        date  product_id  city_id  orders  date_year  date_month
0 2019-12-10        5628       25       3       2019          12
1 2018-08-15        3646       14     157       2018           8
2 2018-10-23        1859       25       1       2018          10

In [16]:
date['date_name_month'] = date['date'].dt.month_name() #extract name of the month from dataset
date.head(3)

,date,product_id,city_id,orders,date_year,date_month,date_name_month
0,2019-12-10,5628,25,3,2019,12,December
1,2018-08-15,3646,14,157,2018,8,August
2,2018-10-23,1859,25,1,2018,10,October

In [18]:
#extract days
date['date_day']= date['date'].dt.day
date.head(3)

,date,product_id,city_id,orders,date_year,date_month,date_name_month,date_day
0,2019-12-10,5628,25,3,2019,12,December,10
1,2018-08-15,3646,14,157,2018,8,August,15
2,2018-10-23,1859,25,1,2018,10,October,23

In [20]:
# day of the week
date['date_day'] = date['date'].dt.dayofweek
date.head(3)

,date,product_id,city_id,orders,date_year,date_month,date_name_month,date_day
0,2019-12-10,5628,25,3,2019,12,December,1
1,2018-08-15,3646,14,157,2018,8,August,2
2,2018-10-23,1859,25,1,2018,10,October,1

In [21]:
#day of week - name
date['date_dow_name'] = date['date'].dt.day_name()

In [22]:
date.head(3)

,date,product_id,city_id,orders,date_year,date_month,date_name_month,date_day,date_dow_name
0,2019-12-10,5628,25,3,2019,12,December,1,Tuesday
1,2018-08-15,3646,14,157,2018,8,August,2,Wednesday
2,2018-10-23,1859,25,1,2018,10,October,1,Tuesday

In [24]:
date.drop(columns=['product_id','city_id','orders'])

          date  date_year  date_month date_name_month  date_day date_dow_name
0   2019-12-10       2019          12        December         1       Tuesday
1   2018-08-15       2018           8          August         2     Wednesday
2   2018-10-23       2018          10         October         1       Tuesday
3   2019-08-17       2019           8          August         5      Saturday
4   2019-01-06       2019           1         January         6        Sunday
..         ...        ...         ...             ...       ...           ...
995 2018-10-08       2018          10         October         0        Monday
996 2018-12-06       2018          12        December         3      Thursday
997 2019-05-07       2019           5             May         1       Tuesday
998 2019-03-03       2019           3           March         6        Sunday
999 2019-10-15       2019          10         October         1       Tuesday

[1000 rows x 6 columns]

In [25]:
# is weekend

date['date_is_weekend']= np.where(date['date_dow_name'].isin(['Sunday','Saturday']),1,0)

In [26]:
date.head(4)

,date,product_id,city_id,orders,date_year,date_month,date_name_month,date_day,date_dow_name,date_is_weekend
0,2019-12-10,5628,25,3,2019,12,December,1,Tuesday,0
1,2018-08-15,3646,14,157,2018,8,August,2,Wednesday,0
2,2018-10-23,1859,25,1,2018,10,October,1,Tuesday,0
3,2019-08-17,7292,25,1,2019,8,August,5,Saturday,1

In [27]:
# dt.week -- to get week number 
#quater 12months 4 quaters

In [28]:
#Extract Time elapsed between dates 
import datetime

today= datetime.datetime.today()

In [29]:
today

datetime.datetime(2022, 7, 16, 15, 24, 23, 621059)

In [30]:
today - date['date']

0      949 days 15:24:23.621059
1     1431 days 15:24:23.621059
2     1362 days 15:24:23.621059
3     1064 days 15:24:23.621059
4     1287 days 15:24:23.621059
                 ...
995   1377 days 15:24:23.621059
996   1318 days 15:24:23.621059
997   1166 days 15:24:23.621059
998   1231 days 15:24:23.621059
999   1005 days 15:24:23.621059
Name: date, Length: 1000, dtype: timedelta64[ns]

In [31]:
#months passed

np.round((today-date['date'])/np.timedelta64(1,'M'),0)

0      31.0
1      47.0
2      45.0
3      35.0
4      42.0
       ...
995    45.0
996    43.0
997    38.0
998    40.0
999    33.0
Name: date, Length: 1000, dtype: float64

In [32]:
time

                    date                                                msg
0    2013-12-15 00:50:00                           ищу на сегодня мужика 37
1    2014-04-29 23:40:00   ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826
2    2012-12-30 00:21:00           Днепр.м 43 позн.с д/ж *.о  067.16.34.576
3    2014-11-28 00:31:00  КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...
4    2013-10-26 23:11:00    Зая я тебя никогда не обижу  люблю тебя!)  Даше
..                   ...                                                ...
995  2012-03-16 00:50:00     ПАРЕНЬ СДЕЛАЕТ  МАССАЖ ЖЕНЩИНАМ -066-877-32-44
996  2014-01-23 23:14:00            сельский п 23 ищу девушку для отношений
997  2012-10-15 23:37:00  Д+Д ДЛЯ серьезных отношений. Мой номер 093-156...
998  2012-06-21 23:34:00  7 ДНЕПР М.34 ПОЗ.С Д/Ж ДЛЯ ВСТРЕЧ.Т.098 809 15 14
999  2014-06-19 23:25:00          Парень поласкает девушке...  т.0662035584

[1000 rows x 2 columns]

In [33]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   object
 1   msg     1000 non-null   object
dtypes: object(2)
memory usage: 15.8+ KB

In [34]:
time['date']= pd.to_datetime(time['date'])

In [35]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   datetime64[ns]
 1   msg     1000 non-null   object
dtypes: datetime64[ns](1), object(1)
memory usage: 15.8+ KB

In [37]:
time['hour'] = time['date'].dt.hour
time['min'] = time['date'].dt.minute
time['sec'] = time['date'].dt.second

In [38]:
time.head(3)

,date,msg,hour,min,sec
0,2013-12-15 00:50:00,ищу на сегодня мужика 37,0,50,0
1,2014-04-29 23:40:00,ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826,23,40,0
2,2012-12-30 00:21:00,Днепр.м 43 позн.с д/ж *.о 067.16.34.576,0,21,0

In [39]:
time['time']= time['date'].dt.time

In [40]:
time.head(3)

,date,msg,hour,min,sec,time
0,2013-12-15 00:50:00,ищу на сегодня мужика 37,0,50,0,00:50:00
1,2014-04-29 23:40:00,ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826,23,40,0,23:40:00
2,2012-12-30 00:21:00,Днепр.м 43 позн.с д/ж *.о 067.16.34.576,0,21,0,00:21:00